[
  {
    "title": "Administrative Assistant Intern",
    "description": "Main Role and Responsibilities: As a Remote Administrative Assistant Intern, you will play a pivotal role in supporting the administrative functions of our firm. Your primary responsibilities will include: • Coordinating with team members to collect necessary paperwork. • Sending reminders to team members about important deadlines, meetings, and asks. • Compiling and organizing administrative files, including payroll, expense reports, and client records. • Drafting and editing emails, memos, and other correspondence for internal and external stakeholders. • Communicating with suppliers and vendors to address inquiries, place orders, and resolve issues. • Providing general administrative support and assisting with ad hoc projects as assigned. Required Skills: • Strong organizational skills with the ability to prioritize tasks effectively. • Excellent written and verbal communication skills. • Proficiency in Microsoft Office Suite and Canva • Detail-oriented with a high level of accuracy. • Ability to work independently and take initiative. • Minimum diploma in office administration, secretarial services, business, human resource management, or related field Preferred Qualifications: • Prior experience in an administrative role or internship is preferred • Ability to adapt to new technology and software platforms quickly. Perks and Benefits: • Gain valuable hands-on experience in the advisory services industry. • Flexible work arrangement. • Mentorship and guidance from experienced professionals in the field. • Opportunity for growth and advancement within the firm. ...more",
    "skillrequirements": "Advisory and Consultancy",
    "jobType": "Onsite - Unpaid Intern",
    "experienceLevel": "ENTRY Experience Level",
    "deadline": "Deadline: May 16, 2024",
    "location": ""
  },
  {
    "title": "Intern",
    "description": "Job Description: We are seeking a highly motivated and detail-oriented individual with an accounting background to join our software testing team as a Software Testing Intern. In this internship role, you will have the opportunity to apply your accounting knowledge and analytical skills to ensure the quality and accuracy of our software systems. R sponsibilities: 1. Collaborate with the software testing team to understand project requirements and objectives. 2. Conduct thorough logical testing to identify potential issues, discrepancies, or anomalies in the software. 3. Document test results, track defects, and communicate findings to the development team. 4. Participate in team meetings and provide input on testing strategies and process improvements. Requirements: 1. Background in accounting or finance with a strong understanding of financial processes and principles. 2. Excellent analytical and problem-solving skills. 3. Attention to detail and the ability to identify logical inconsistencies or errors. 4. Strong written and verbal communication skills. 5. Ability to work independently as well as collaboratively in a team environment. How to Apply: Interested candidates are invited to submit their resume, cover letter. Note: This internship position is unpaid and requires full-time commitment. ...more",
    "skillrequirements": "Software design and Development",
    "jobType": "Remote - Unpaid Intern",
    "experienceLevel": "ENTRY Experience Level",
    "deadline": "Deadline: May 13, 2024",
    "location": ""
  },
  {
    "title": "INTERNSHIP ADMINISTRATIVE ASSISTANT",
    "description": "Join our innovative metal design factory as an internship Administrative Assistant. This role will assist the Director of the company in various tasks related to marketing, finances, sales, human resources, information technology, design, engineering, manufacturing, inventory, purchasing, and reporting. Gain valuable experience in a dynamic meta design factory environment. If you're eager to learn and contribute to multiple facets of our operations, apply now! ...more",
    "skillrequirements": "Project management and administration",
    "jobType": "Onsite - Unpaid Intern",
    "experienceLevel": "EXPERT Experience Level",
    "deadline": "Deadline: May 11, 2024",
    "location": ""
  },
  {
    "title": "INTERNSHIP GRAPHICS DESIGNER",
    "description": "Join our innovative metal design factory as internship Graphic Designer to play a pivotal role in visually communicating the essence of the company's creations. Responsibilities may include: 1. Visual Branding: Developing and maintaining a cohesive visual identity for the company across various platforms. 2. Marketing Materials: Designing brochur s, catalogs, and promotional materials to showcase metal designs for architecture, interior design, product design, signage, electromechanical, and artwork. 3. Digital Presence: Crafting engaging visuals for the company's website, social media, and online marketing campaigns. 4. Product Visualization: Creating visual representations of metal objects, providing clients and stakeholders with a preview of the final designs. 5. Collaboration: Working closely with the marketing and sales teams to align graphic design with promotional strategies and client expectations. 6. Artistic Direction: Contributing to the artistic direction of projects, ensuring designs align with the company's philosophy and standards. 7. Presentation Graphics: Developing visually compelling presentations for client meetings, showcasing the diversity and quality of metal designs. 8. Print Materials: Designing print materials such as packaging, labels, and exhibition materials. A skilled Graphic Designer enhances the overall aesthetic appeal of the metal designs, contributing to the success of marketing efforts and the company's brand image. ...more",
    "skillrequirements": "Marketing and Advertisement",
    "jobType": "Onsite - Unpaid Intern",
    "experienceLevel": "EXPERT Experience Level",
    "deadline": "Deadline: May 11, 2024",
    "location": ""
  },
  {
    "title": "Internship Opportunity: MERN Stack Developer with Frontend Specialization",
    "description": "We are seeking a motivated and enthusiastic intern to join our team as a MERN (MongoDB, Express.js, React.js, Node.js) Stack Developer with a focus on frontend development. This internship offers a unique opportunity to gain hands-on experience in a fast-paced environment, working on cutting-edge projects that impact our industry. Responsibilities Collaborate with our development team to design, develop, and maintain web applications using the MERN stack. Implement responsive and visually appealing user interfaces using HTML, CSS, and JavaScript frameworks. Participate in code reviews, testing, and debugging to ensure high-quality software delivery. Stay up-to-date with emerging technologies and industry trends to continuously improve our products. Requirements: Proficiency in JavaScript, HTML, and CSS. Familiarity with the MERN stack and its components (MongoDB, Express.js, React.js, Node.js). Strong understanding of frontend development principles and best practices. Ability to work independently and as part of a collaborative team. Excellent problem-solving and communication skills. Prior experience or projects showcasing frontend development skills is a plus. Benefits: Opportunity to work on challenging projects and gain real-world experience. Mentorship from experienced professionals in the field. Flexible schedule and possibility for remote work. Networking opportunities with industry experts and fellow interns. Potential for future employment opportunities based on performance. ...more",
    "skillrequirements": "Software design and Development",
    "jobType": "Onsite - Paid Intern",
    "experienceLevel": "INTERMEDIATE Experience Level",
    "deadline": "Deadline: May 09, 2024",
    "location": ""
  },
  {
    "title": "Business Development Intern",
    "description": "Interns that enroll in this program will contribute to challenging projects and be involved in the operations to bring an actual impact to the company and gain real world experience needed to contribute to your learning and growth. Responsibilities: ● Provide additional content that will be benefiting for projects and operations ● Assist in diffe ent tasks in their assigned department or project ● Documentation and follow-up on planned activities Requirement: ● Good attitude and gusto to learning new things ● Working knowledge of Google tools ● Enrolled in universities in any social science fields ● Ability to research and provide input for the team on assignments ● Working knowledge of business writing and content development Interested applicants please apply using this link: https://career.icogacc.com/internships/c579274e-6c5d-4be1-8ec9-799b585f200d ...more",
    "skillrequirements": "Business and Commerce",
    "jobType": "Onsite - Paid Intern",
    "experienceLevel": "ENTRY Experience Level",
    "deadline": "Deadline: May 23, 2024",
    "location": ""
  },
  {
    "title": "Junior Architects & Interior Designer",
    "description": "Qualification: BSc degree in Architecture • Minimum Years of Experience: 0 year ️Deadline: April 29/2024 ▪️How to Apply: • Interested applicants who fulfill the above criteria, are required to send an application letter with scan CV and credentials within 7 working days of this announcement Qualification: BSc degree in Architecture • Minimum Years of Experience: 0 year ️Deadline: April 29/2024 ▪️How to Apply: • Interested applicants who fulfill the above criteria, are required to send an application letter with scan CV and credentials within 7 working days of this announcement",
    "skillrequirements": "Architecture and urban planning",
    "jobType": "Onsite - Paid Intern",
    "experienceLevel": "JUNIOR Experience Level",
    "deadline": "Deadline: May 06, 2024",
    "location": ""
  }
]
